{
    "data": [
        {
            "title": "Overview",
            "description": "This is a web-based application that allows users to print documents online from any location. Users can upload PDF files, select a printing shop, pay online, and get notified when their documents are ready. Users can also manage their orders, wallet, and profile through the application."
        },
        {
            "title": "Hassle Free",
            "description": "The application aims to digitalize the printing process and save time and money for users and vendors1. Users can compare prices and locations of different printing shops and choose the best option for them. Vendors can receive orders and payments online and reduce the hassle of manual operations."
        },
        {
            "title": "Social Cause",
            "description": "The application also promotes social distancing and reduces the risk of virus transmission. Users do not need to use USB drives or share their contact details with vendors. They can also avoid waiting in queues and crowds at printing shops. They can simply pick up their documents whenever they want."
        },
        {
            "title": "Multiple Applications",
            "description": "The application has potential applications in various sectors such as schools, colleges, private companies, and government offices. It can also be integrated with delivery services and embedded systems for more convenience and automation. It can help the society to be more productive and efficient."
        }
    ],
    "id": "project",
    "colors": {
        "bgColor": "project2bg",
        "tileBgColor": "project2TileBg"
    },
    "about": {
        "header": "My Educational Project",
        "title": "Online Printing System",
        "description": "Revolutionize your printing experience with this one-of-a-kind software, designed to streamline the photocopying and printing process while transforming into a convenient online marketplace for all your printing needs."
    },
    "buttons": [
        {
            "link": "https://drive.google.com/file/d/1ISZ8sVpOcht-sG76wy9BUV70rn9T8PjX/view",
            "title": "See Report"
        },
        {
            "link": "https://docs.google.com/presentation/d/15_VDOma1QvK0Ef_t3zNDRL0LKDhaU4mJtRyvpvPXsuk/edit?usp=sharing",
            "title": "See Presentation"
        },
        {
            "link": "https://letsprint.netlify.app/",
            "title": "See Webapp"
        }
    ],
    "youtube": {
        "width": "560",
        "height": "315",
        "link": "https://www.youtube.com/embed/XJP3vcWcYkg?si=R9ML7QoOdIMN_JN9"
    }
}